base/Catalogs/бит_СтруктураКонструктораДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_СтруктураКонструктораДвижений</Name>
			<Comment>//содержит настройки внешнего вида конструктора движений для регистров</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Регистр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыРеквизитовДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыРеквизитовДвижений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СинонимРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоложениеКолонки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ПоложенияКолонокТаблицы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Видимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_ВидыРеквизитовДвижений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыРеквизитовДвижений</Name>
			<Comment>//Список возможных реквизитов движений в разрезе регистров</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыЗначений</Name>
					<Comment>//содержит описание возможных типов значений</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчаствуетВДвижении</Name>
					<Comment>//признак того, что реквизит является непосредственным участником движений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРегистра</Name>
					<Comment>Строковое представление типа регистра</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяРегистра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субконто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ведущий</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

base/Catalogs/бит_СтруктураКонструктораДвижений/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет табличную часть элемента справочника параметрами реквизитов
// (элементами справочника "Виды реквизитов движений").
// 

// Процедура - Заполнить ТЧРеквизитами регистра
// Заполняет табличную часть элемента справочника параметрами реквизитов
// (элементами справочника "Виды реквизитов движений").
//
// Параметры:
//  РегистрСсылка	 - СправочникСсылка.бит_ВидыРеквизитовДвижений	 - группа.
//
Процедура ЗаполнитьТЧРеквизитамиРегистра(РегистрСсылка) Экспорт
	
	Если не ЗначениеЗаполнено(РегистрСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Заполним табличную часть
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ВидыРеквизитовДвижений.Ссылка КАК Реквизит,
	               |	бит_ВидыРеквизитовДвижений.ПредставлениеЭлемента КАК СинонимРеквизита,
	               |	бит_ВидыРеквизитовДвижений.ТипыЗначений КАК ТипРеквизита,
	               |	ЗНАЧЕНИЕ(Перечисление.бит_ПоложенияКолонокТаблицы.НоваяКолонка) КАК ПоложениеКолонки,
	               |	20 КАК ШиринаКолонки,
	               |	ИСТИНА КАК Видимость
	               |ИЗ
	               |	Справочник.бит_ВидыРеквизитовДвижений КАК бит_ВидыРеквизитовДвижений
	               |ГДЕ
	               |	бит_ВидыРеквизитовДвижений.Родитель = &РегистрСсылка";
				   
	Запрос.УстановитьПараметр("РегистрСсылка", РегистрСсылка);
	Результат = Запрос.Выполнить().Выгрузить();
	Результат.Колонки.Добавить("НомерКолонки");
	жи = 0;
	
	Для Каждого Элемент Из Результат Цикл
		Элемент.НомерКолонки = жи;
		жи = жи + 1;
	КонецЦикла;
	
	ПараметрыКолонок.Загрузить(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	ПроверитьНаДубли(Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНаДубли(Отказ)
		
	// Проверим на дубли по регистрам, а заодно сделаем защиту от копирования.	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Реквизиты.Регистр
	|ИЗ
	|	Справочник.бит_СтруктураКонструктораДвижений КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка <> &Ссылка
	|	И Реквизиты.Регистр = &Регистр
	|	И НЕ Реквизиты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Регистр", Регистр);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда		
		ТекстСообщения = СтрШаблон(НСтр("ru='Настройка конструктора для регистра ""%1"" уже введена.';
										|en='Setting register constructor for ""%1"" has already been introduced.'"), 
								   Регистр); 				   
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("ПОЛЕ", "КОРРЕКТНОСТЬ", "Регистр",,, ТекстСообщения);		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,, "Регистр", "Объект", Отказ);		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
